# Dotfiles dependencies — packages that stow configs or setup.sh rely on
# For full workstation provisioning, see Brewfile.workstation

# Core (stow + shell)
brew "stow"
brew "zsh-autosuggestions"
brew "starship"
brew "mise"
brew "zoxide"
brew "direnv"
brew "atuin"
brew "coreutils"

# Terminal & editors
brew "tmux"
brew "tmuxinator"
brew "neovim"
brew "bat"
brew "glow"
brew "btop"
brew "tree"

# Git
brew "git"
brew "glab"
brew "pre-commit"

# Shell tools
brew "shellcheck"
brew "duti"
brew "yq"
brew "unar"

# Recording
brew "asciinema"

# VPN script dependency
brew "openfortivpn"
brew "bitwarden-cli"
