# Taps
tap "anomalyco/tap"
tap "derailed/k9s"
tap "fluxcd/tap"
tap "hudochenkov/sshpass"
tap "int128/kubelogin"
tap "metalbear-co/mirrord"
tap "siderolabs/tap"

# CLI Tools
brew "bat"
brew "btop"
brew "cloc"
brew "coreutils"
brew "direnv"
brew "glow"
brew "mise"
brew "neovim"
brew "shellcheck"
brew "starship"
brew "stow"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "unar"
brew "zoxide"
brew "zsh-autosuggestions"

# Shell History & Recording
brew "asciinema"
brew "atuin"

# Git
brew "git"
brew "git-filter-repo"
brew "glab"
brew "pre-commit"

# Development
brew "go"
brew "node@20"
brew "python@3.13"
brew "duckdb"

# Networking & Security
brew "age"
brew "cloudflared"
brew "detect-secrets"
brew "mosquitto"
brew "nmap"
brew "openfortivpn"
brew "sops"
brew "bitwarden-cli"
brew "hudochenkov/sshpass/sshpass"

# Containers & Kubernetes
brew "docker"
brew "podman"
brew "kubernetes-cli"
brew "helm"
brew "kubeseal"
brew "crane"
brew "regclient"
brew "skopeo"
brew "derailed/k9s/k9s"
brew "fluxcd/tap/flux"
brew "int128/kubelogin/kubelogin"
brew "metalbear-co/mirrord/mirrord"
brew "siderolabs/tap/talosctl"

# Infrastructure
brew "ansible"
brew "ipmitool"
brew "rclone"
brew "terraform"

# Media & Documents
brew "ffmpeg"
brew "networkit"
brew "pandoc"

# AI Tools
brew "anomalyco/tap/opencode"

# Casks
cask "bruno"
cask "chromium"
cask "docker-desktop"
cask "gcloud-cli"
cask "jetbrains-toolbox"
cask "mqtt-explorer"
cask "obsidian"
cask "orbstack"
cask "wezterm"

# Go binaries
go "github.com/bootdotdev/bootdev"
go "golang.org/x/tools/gopls"
